ChriD/konnekting-TouchButtonSwitch/hardware/boards.txt
# KONNEKTING_TOUCHSWITCH_F303RE
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE=KONNEKTING_TOUCHSWITCH_F303RE
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.node=NODE_F303RE
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.upload.maximum_data_size=65536
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.build.board=KONNEKTING_TOUCHSWITCH_F303RE
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.build.series=STM32F3xx
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.build.product_line=STM32F303xE
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.build.variant=KONNEKTING_TOUCHSWITCH_F303RE
Nucleo_64.menu.pnum.KONNEKTING_TOUCHSWITCH_F303RE.build.cmsis_lib_gcc=arm_cortexM4l_math